In [1]:
import pandas as pd

In [113]:
df = pd.read_csv("employee_records.csv")

In [114]:
df

    eid               ename                       eemailid               city
0     1        Tamara House            carol99@example.com          Whitestad
1     2    Patricia Stevens          hbradford@example.net      East Veronica
2     3         Victor Ryan           joseph88@example.com     Gutierrezmouth
3     4         David Glass     timothyroberts@example.org   East Kristenstad
4     5      Lori Contreras            msawyer@example.com     North Luisside
..  ...                 ...                            ...                ...
95   96          Jill Tapia              fchen@example.org       South Vernon
96   97        Alexis Smith       timothysmith@example.net        Millerburgh
97   98         Terry Cohen  gabriellemartinez@example.com         Meghanside
98   99  Christopher Berger          heather86@example.org  West Lorrainefurt
99  100        Wendy Turner   clarkchristopher@example.net       West Jeffrey

[100 rows x 4 columns]

In [ ]:
UDF: user defined function

custom function apply DF

In [27]:
df = pd.DataFrame({"id":[1,2,3,4],
                   "sal":[30000,50000,25000,58000],
                   "c":["m","f","f","m"]
                  })

In [6]:
df

   a  b  c
0  1  3  6
1  2  5  6
2  3  2  3
3  4  5  6

In [7]:
def element_sqr(element):
    return element**2

In [8]:
df.apply(element_sqr)

    a   b   c
0   1   9  36
1   4  25  36
2   9   4   9
3  16  25  36

In [ ]:
apply -- function on complete DF

In [9]:
df['c'].apply(element_sqr)

0    36
1    36
2     9
3    36
Name: c, dtype: int64

In [ ]:
map(function) --> col

In [11]:
df

   a  b  c
0  1  3  m
1  2  5  f
2  3  2  f
3  4  5  m

In [12]:
def gen_encode(gen):
    if gen=='m':
        return 1
    else:
        return 0

In [14]:
df['d']= df['c'].map(gen_encode)

In [15]:
df

   a  b  c  d
0  1  3  m  1
1  2  5  f  0
2  3  2  f  0
3  4  5  m  1

In [16]:
df

   a  b  c  d
0  1  3  m  1
1  2  5  f  0
2  3  2  f  0
3  4  5  m  1

In [18]:
df

    eid               ename                       eemailid               city
0     1        Tamara House            carol99@example.com          Whitestad
1     2    Patricia Stevens          hbradford@example.net      East Veronica
2     3         Victor Ryan           joseph88@example.com     Gutierrezmouth
3     4         David Glass     timothyroberts@example.org   East Kristenstad
4     5      Lori Contreras            msawyer@example.com     North Luisside
..  ...                 ...                            ...                ...
95   96          Jill Tapia              fchen@example.org       South Vernon
96   97        Alexis Smith       timothysmith@example.net        Millerburgh
97   98         Terry Cohen  gabriellemartinez@example.com         Meghanside
98   99  Christopher Berger          heather86@example.org  West Lorrainefurt
99  100        Wendy Turner   clarkchristopher@example.net       West Jeffrey

[100 rows x 4 columns]

In [19]:
def username(email):
    username = email.split('@')[0]
    return username

In [21]:
df['username'] = df['eemailid'].map(username)

In [22]:
df

,eid,ename,eemailid,city,username
0,1,Tamara House,carol99@example.com,Whitestad,carol99
1,2,Patricia Stevens,hbradford@example.net,East Veronica,hbradford
2,3,Victor Ryan,joseph88@example.com,Gutierrezmouth,joseph88
3,4,David Glass,timothyroberts@example.org,East Kristenstad,timothyroberts
4,5,Lori Contreras,msawyer@example.com,North Luisside,msawyer
...,...,...,...,...,...
95,96,Jill Tapia,fchen@example.org,South Vernon,fchen
96,97,Alexis Smith,timothysmith@example.net,Millerburgh,timothysmith
97,98,Terry Cohen,gabriellemartinez@example.com,Meghanside,gabriellemartinez
98,99,Christopher Berger,heather86@example.org,West Lorrainefurt,heather86
99,100,Wendy Turner,clarkchristopher@example.net,West Jeffrey,clarkchristopher

In [ ]:
map  with lambda

In [25]:
df['test'] = df['eemailid'].map(lambda x: x.split('@')[0])

In [26]:
df

,eid,ename,eemailid,city,username,test
0,1,Tamara House,carol99@example.com,Whitestad,carol99,carol99
1,2,Patricia Stevens,hbradford@example.net,East Veronica,hbradford,hbradford
2,3,Victor Ryan,joseph88@example.com,Gutierrezmouth,joseph88,joseph88
3,4,David Glass,timothyroberts@example.org,East Kristenstad,timothyroberts,timothyroberts
4,5,Lori Contreras,msawyer@example.com,North Luisside,msawyer,msawyer
...,...,...,...,...,...,...
95,96,Jill Tapia,fchen@example.org,South Vernon,fchen,fchen
96,97,Alexis Smith,timothysmith@example.net,Millerburgh,timothysmith,timothysmith
97,98,Terry Cohen,gabriellemartinez@example.com,Meghanside,gabriellemartinez,gabriellemartinez
98,99,Christopher Berger,heather86@example.org,West Lorrainefurt,heather86,heather86
99,100,Wendy Turner,clarkchristopher@example.net,West Jeffrey,clarkchristopher,clarkchristopher

In [28]:
df

   id    sal  c
0   1  30000  m
1   2  50000  f
2   3  25000  f
3   4  58000  m

In [ ]:
0-25 - low 

26-30 -  medium

31- 50 -  moderate

51-100 - high sal

In [33]:
def sal_tagging(sal):
    if sal>0 and sal<=25000:
        return "low"
    elif sal>=26000 and sal<=30000:
        return "meduim"
    elif sal>=31000 and sal<=51000:
        return "moderate"
    else:
        return "high"

In [35]:
df['sal_tagg'] = df['sal'].map(sal_tagging)

In [36]:
df

   id    sal  c  sal_tagg
0   1  30000  m    meduim
1   2  50000  f  moderate
2   3  25000  f       low
3   4  58000  m      high

In [ ]:
5. Handling Missing Data
df.isnull() – Check for missing values.
df.notnull() – Check for non-missing values.
df.dropna() – Drop rows or columns with missing values.
df.fillna() – Fill missing values.
df.replace() – Replace specific values in the DataFrame.
df.ffill() – Forward fill missing values.
df.bfill() – Backward fill missing values.
df.interpolate() – Interpolate missing values.
df.dropna(how='all') – Drop rows or columns with all missing values.
df.dropna(axis=1) – Drop columns with missing values.
df.fillna(method='ffill') – Fill using forward fill method.

In [ ]:
Real time Data --> Impurities --> Null values

In [ ]:
mean --median -- mode
cal --> BRD

In [37]:
df = pd.read_csv("empdata100.csv")

In [38]:
df

       id    name    city       sal
0   101.0  keshav    pune   54545.0
1   102.0   rahul    pune   64646.0
2   103.0     ram     NaN       NaN
3     NaN     NaN     NaN       NaN
4     NaN     NaN     NaN       NaN
5     NaN     NaN     NaN       NaN
6   104.0  sonali  mumbai  565665.0
7   105.0  monali    pune   65656.0
8   106.0  rakesh    pune  757575.0
9   107.0     NaN     NaN       NaN
10    NaN     NaN     NaN       NaN
11    NaN     NaN     NaN       NaN
12  108.0     NaN     NaN       NaN
13  109.0   rahul    pune   64646.0

In [ ]:
null count -- by col wise

In [40]:
df.isnull().sum()

id      5
name    7
city    8
sal     8
dtype: int64

In [ ]:
DQI -- null

In [44]:
df[~df['id'].isnull()]

       id    name    city       sal
0   101.0  keshav    pune   54545.0
1   102.0   rahul    pune   64646.0
2   103.0     ram     NaN       NaN
6   104.0  sonali  mumbai  565665.0
7   105.0  monali    pune   65656.0
8   106.0  rakesh    pune  757575.0
9   107.0     NaN     NaN       NaN
12  108.0     NaN     NaN       NaN
13  109.0   rahul    pune   64646.0

In [45]:
df.isnull()

       id   name   city    sal
0   False  False  False  False
1   False  False  False  False
2   False  False   True   True
3    True   True   True   True
4    True   True   True   True
5    True   True   True   True
6   False  False  False  False
7   False  False  False  False
8   False  False  False  False
9   False   True   True   True
10   True   True   True   True
11   True   True   True   True
12  False   True   True   True
13  False  False  False  False

In [48]:
df.notnull().sum()

id      9
name    7
city    6
sal     6
dtype: int64

In [49]:
df

       id    name    city       sal
0   101.0  keshav    pune   54545.0
1   102.0   rahul    pune   64646.0
2   103.0     ram     NaN       NaN
3     NaN     NaN     NaN       NaN
4     NaN     NaN     NaN       NaN
5     NaN     NaN     NaN       NaN
6   104.0  sonali  mumbai  565665.0
7   105.0  monali    pune   65656.0
8   106.0  rakesh    pune  757575.0
9   107.0     NaN     NaN       NaN
10    NaN     NaN     NaN       NaN
11    NaN     NaN     NaN       NaN
12  108.0     NaN     NaN       NaN
13  109.0   rahul    pune   64646.0

In [ ]:
df.dropna() – Drop rows or columns with missing values.
df.fillna() – Fill missing values.
df.replace() – Replace specific values in the DataFrame.
df.ffill() – Forward fill missing values.
df.bfill() – Backward fill missing values.
df.dropna(how='all') – Drop rows or columns with all missing values.
df.dropna(axis=1) – Drop columns with missing values.
df.fillna(method='ffill') – Fill using forward fill method.

In [53]:
df.dropna()

       id    name    city       sal
0   101.0  keshav    pune   54545.0
1   102.0   rahul    pune   64646.0
6   104.0  sonali  mumbai  565665.0
7   105.0  monali    pune   65656.0
8   106.0  rakesh    pune  757575.0
13  109.0   rahul    pune   64646.0

In [ ]:
null -- id

In [57]:
df.dropna(subset=['id','name'])

       id    name    city       sal
0   101.0  keshav    pune   54545.0
1   102.0   rahul    pune   64646.0
2   103.0     ram     NaN       NaN
6   104.0  sonali  mumbai  565665.0
7   105.0  monali    pune   65656.0
8   106.0  rakesh    pune  757575.0
13  109.0   rahul    pune   64646.0

In [58]:
dropna 
how -- > any | all
thresh

       id    name    city       sal
0   101.0  keshav    pune   54545.0
1   102.0   rahul    pune   64646.0
2   103.0     ram     NaN       NaN
3     NaN     NaN     NaN       NaN
4     NaN     NaN     NaN       NaN
5     NaN     NaN     NaN       NaN
6   104.0  sonali  mumbai  565665.0
7   105.0  monali    pune   65656.0
8   106.0  rakesh    pune  757575.0
9   107.0     NaN     NaN       NaN
10    NaN     NaN     NaN       NaN
11    NaN     NaN     NaN       NaN
12  108.0     NaN     NaN       NaN
13  109.0   rahul    pune   64646.0

In [60]:
df.dropna(how='all')

       id    name    city       sal
0   101.0  keshav    pune   54545.0
1   102.0   rahul    pune   64646.0
2   103.0     ram     NaN       NaN
6   104.0  sonali  mumbai  565665.0
7   105.0  monali    pune   65656.0
8   106.0  rakesh    pune  757575.0
9   107.0     NaN     NaN       NaN
12  108.0     NaN     NaN       NaN
13  109.0   rahul    pune   64646.0

In [ ]:
BRD - drop row which contain all null values
BRD - drop col which contains all null values

In [ ]:
dropna- threash  --

threash -- 2 --> row at 2 values should be not null

In [63]:
df.dropna(thresh=2)

       id    name    city       sal
0   101.0  keshav    pune   54545.0
1   102.0   rahul    pune   64646.0
2   103.0     ram     NaN       NaN
6   104.0  sonali  mumbai  565665.0
7   105.0  monali    pune   65656.0
8   106.0  rakesh    pune  757575.0
13  109.0   rahul    pune   64646.0

In [ ]:
dropna --> how and threash

In [65]:
df.dropna(ignore_index=True)

      id    name    city       sal
0  101.0  keshav    pune   54545.0
1  102.0   rahul    pune   64646.0
2  104.0  sonali  mumbai  565665.0
3  105.0  monali    pune   65656.0
4  106.0  rakesh    pune  757575.0
5  109.0   rahul    pune   64646.0

In [ ]:
fillna :
values fill

In [66]:
df

       id    name    city       sal
0   101.0  keshav    pune   54545.0
1   102.0   rahul    pune   64646.0
2   103.0     ram     NaN       NaN
3     NaN     NaN     NaN       NaN
4     NaN     NaN     NaN       NaN
5     NaN     NaN     NaN       NaN
6   104.0  sonali  mumbai  565665.0
7   105.0  monali    pune   65656.0
8   106.0  rakesh    pune  757575.0
9   107.0     NaN     NaN       NaN
10    NaN     NaN     NaN       NaN
11    NaN     NaN     NaN       NaN
12  108.0     NaN     NaN       NaN
13  109.0   rahul    pune   64646.0

In [67]:
df.fillna(0)

       id    name    city       sal
0   101.0  keshav    pune   54545.0
1   102.0   rahul    pune   64646.0
2   103.0     ram       0       0.0
3     0.0       0       0       0.0
4     0.0       0       0       0.0
5     0.0       0       0       0.0
6   104.0  sonali  mumbai  565665.0
7   105.0  monali    pune   65656.0
8   106.0  rakesh    pune  757575.0
9   107.0       0       0       0.0
10    0.0       0       0       0.0
11    0.0       0       0       0.0
12  108.0       0       0       0.0
13  109.0   rahul    pune   64646.0

In [ ]:
mean
median 
mode

In [69]:
df['sal'].mean()

262122.16666666666

In [70]:
df['sal'].median()

65151.0

In [71]:
df['sal'].mode()

0    64646.0
Name: sal, dtype: float64

In [73]:
df['sal_mean'] = df['sal'].fillna(df['sal'].mean())

In [74]:
df

       id    name    city       sal       sal_mean
0   101.0  keshav    pune   54545.0   54545.000000
1   102.0   rahul    pune   64646.0   64646.000000
2   103.0     ram     NaN       NaN  262122.166667
3     NaN     NaN     NaN       NaN  262122.166667
4     NaN     NaN     NaN       NaN  262122.166667
5     NaN     NaN     NaN       NaN  262122.166667
6   104.0  sonali  mumbai  565665.0  565665.000000
7   105.0  monali    pune   65656.0   65656.000000
8   106.0  rakesh    pune  757575.0  757575.000000
9   107.0     NaN     NaN       NaN  262122.166667
10    NaN     NaN     NaN       NaN  262122.166667
11    NaN     NaN     NaN       NaN  262122.166667
12  108.0     NaN     NaN       NaN  262122.166667
13  109.0   rahul    pune   64646.0   64646.000000

In [ ]:
char -- mode 

numer == mean | median

In [ ]:
mean ---avg

In [ ]:
16 15 16 16 17 17 16 [] 16 15 16 17

In [ ]:
mean -- avg
median -- middle value
mode -- frequnt value

In [76]:
df['sal'].fillna(30000)

0      54545.0
1      64646.0
2      30000.0
3      30000.0
4      30000.0
5      30000.0
6     565665.0
7      65656.0
8     757575.0
9      30000.0
10     30000.0
11     30000.0
12     30000.0
13     64646.0
Name: sal, dtype: float64

In [77]:
df

       id    name    city       sal       sal_mean
0   101.0  keshav    pune   54545.0   54545.000000
1   102.0   rahul    pune   64646.0   64646.000000
2   103.0     ram     NaN       NaN  262122.166667
3     NaN     NaN     NaN       NaN  262122.166667
4     NaN     NaN     NaN       NaN  262122.166667
5     NaN     NaN     NaN       NaN  262122.166667
6   104.0  sonali  mumbai  565665.0  565665.000000
7   105.0  monali    pune   65656.0   65656.000000
8   106.0  rakesh    pune  757575.0  757575.000000
9   107.0     NaN     NaN       NaN  262122.166667
10    NaN     NaN     NaN       NaN  262122.166667
11    NaN     NaN     NaN       NaN  262122.166667
12  108.0     NaN     NaN       NaN  262122.166667
13  109.0   rahul    pune   64646.0   64646.000000

In [79]:
df['city_ffill'] = df['city'].fillna(method='ffill')

C:\Users\AI NEXUT IT\AppData\Local\Temp\ipykernel_61788\2315224074.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['city_ffill'] = df['city'].fillna(method='ffill')

In [80]:
df

       id    name    city       sal       sal_mean city_ffill
0   101.0  keshav    pune   54545.0   54545.000000       pune
1   102.0   rahul    pune   64646.0   64646.000000       pune
2   103.0     ram     NaN       NaN  262122.166667       pune
3     NaN     NaN     NaN       NaN  262122.166667       pune
4     NaN     NaN     NaN       NaN  262122.166667       pune
5     NaN     NaN     NaN       NaN  262122.166667       pune
6   104.0  sonali  mumbai  565665.0  565665.000000     mumbai
7   105.0  monali    pune   65656.0   65656.000000       pune
8   106.0  rakesh    pune  757575.0  757575.000000       pune
9   107.0     NaN     NaN       NaN  262122.166667       pune
10    NaN     NaN     NaN       NaN  262122.166667       pune
11    NaN     NaN     NaN       NaN  262122.166667       pune
12  108.0     NaN     NaN       NaN  262122.166667       pune
13  109.0   rahul    pune   64646.0   64646.000000       pune

In [83]:
df['city_bfill']=df['city'].fillna(method='bfill')

C:\Users\AI NEXUT IT\AppData\Local\Temp\ipykernel_61788\2031394623.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['city_bfill']=df['city'].fillna(method='bfill')

In [84]:
df

       id    name    city       sal       sal_mean city_ffill city_bfill
0   101.0  keshav    pune   54545.0   54545.000000       pune       pune
1   102.0   rahul    pune   64646.0   64646.000000       pune       pune
2   103.0     ram     NaN       NaN  262122.166667       pune     mumbai
3     NaN     NaN     NaN       NaN  262122.166667       pune     mumbai
4     NaN     NaN     NaN       NaN  262122.166667       pune     mumbai
5     NaN     NaN     NaN       NaN  262122.166667       pune     mumbai
6   104.0  sonali  mumbai  565665.0  565665.000000     mumbai     mumbai
7   105.0  monali    pune   65656.0   65656.000000       pune       pune
8   106.0  rakesh    pune  757575.0  757575.000000       pune       pune
9   107.0     NaN     NaN       NaN  262122.166667       pune       pune
10    NaN     NaN     NaN       NaN  262122.166667       pune       pune
11    NaN     NaN     NaN       NaN  262122.166667       pune       pune
12  108.0     NaN     NaN       NaN  262122.166667       pune       pune
13  109.0   rahul    pune   64646.0   64646.000000       pune       pune

In [86]:
df['city_limit'] = df['city'].fillna(method='ffill',limit=2)

C:\Users\AI NEXUT IT\AppData\Local\Temp\ipykernel_61788\2009581119.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['city_limit'] = df['city'].fillna(method='ffill',limit=2)

In [87]:
df

,id,name,city,sal,sal_mean,city_ffill,city_bfill,city_limit
0,101.0,keshav,pune,54545.0,54545.000000,pune,pune,pune
1,102.0,rahul,pune,64646.0,64646.000000,pune,pune,pune
2,103.0,ram,NaN,NaN,262122.166667,pune,mumbai,pune
3,NaN,NaN,NaN,NaN,262122.166667,pune,mumbai,pune
4,NaN,NaN,NaN,NaN,262122.166667,pune,mumbai,NaN
5,NaN,NaN,NaN,NaN,262122.166667,pune,mumbai,NaN
6,104.0,sonali,mumbai,565665.0,565665.000000,mumbai,mumbai,mumbai
7,105.0,monali,pune,65656.0,65656.000000,pune,pune,pune
8,106.0,rakesh,pune,757575.0,757575.000000,pune,pune,pune
9,107.0,NaN,NaN,NaN,262122.166667,pune,pune,pune
10,NaN,NaN,NaN,NaN,262122.166667,pune,pune,pune
11,NaN,NaN,NaN,NaN,262122.166667,pune,pune,NaN
12,108.0,NaN,NaN,NaN,262122.166667,pune,pune,NaN
13,109.0,rahul,pune,64646.0,64646.000000,pune,pune,pune

In [90]:
df['city1'] = df['city'].replace("pune","chennai")

In [91]:
df

,id,name,city,sal,sal_mean,city_ffill,city_bfill,city_limit,city1
0,101.0,keshav,pune,54545.0,54545.000000,pune,pune,pune,chennai
1,102.0,rahul,pune,64646.0,64646.000000,pune,pune,pune,chennai
2,103.0,ram,NaN,NaN,262122.166667,pune,mumbai,pune,NaN
3,NaN,NaN,NaN,NaN,262122.166667,pune,mumbai,pune,NaN
4,NaN,NaN,NaN,NaN,262122.166667,pune,mumbai,NaN,NaN
5,NaN,NaN,NaN,NaN,262122.166667,pune,mumbai,NaN,NaN
6,104.0,sonali,mumbai,565665.0,565665.000000,mumbai,mumbai,mumbai,mumbai
7,105.0,monali,pune,65656.0,65656.000000,pune,pune,pune,chennai
8,106.0,rakesh,pune,757575.0,757575.000000,pune,pune,pune,chennai
9,107.0,NaN,NaN,NaN,262122.166667,pune,pune,pune,NaN
10,NaN,NaN,NaN,NaN,262122.166667,pune,pune,pune,NaN
11,NaN,NaN,NaN,NaN,262122.166667,pune,pune,NaN,NaN
12,108.0,NaN,NaN,NaN,262122.166667,pune,pune,NaN,NaN
13,109.0,rahul,pune,64646.0,64646.000000,pune,pune,pune,chennai

In [92]:
import math

In [93]:
round(34.5)

34

In [99]:
df['sal_round'] = df['sal_mean'].map(lambda x: round(x,4))

In [100]:
df

,id,name,city,sal,sal_mean,city_ffill,city_bfill,city_limit,city1,sal_round
0,101.0,keshav,pune,54545.0,54545.000000,pune,pune,pune,chennai,54545.0000
1,102.0,rahul,pune,64646.0,64646.000000,pune,pune,pune,chennai,64646.0000
2,103.0,ram,NaN,NaN,262122.166667,pune,mumbai,pune,NaN,262122.1667
3,NaN,NaN,NaN,NaN,262122.166667,pune,mumbai,pune,NaN,262122.1667
4,NaN,NaN,NaN,NaN,262122.166667,pune,mumbai,NaN,NaN,262122.1667
5,NaN,NaN,NaN,NaN,262122.166667,pune,mumbai,NaN,NaN,262122.1667
6,104.0,sonali,mumbai,565665.0,565665.000000,mumbai,mumbai,mumbai,mumbai,565665.0000
7,105.0,monali,pune,65656.0,65656.000000,pune,pune,pune,chennai,65656.0000
8,106.0,rakesh,pune,757575.0,757575.000000,pune,pune,pune,chennai,757575.0000
9,107.0,NaN,NaN,NaN,262122.166667,pune,pune,pune,NaN,262122.1667
10,NaN,NaN,NaN,NaN,262122.166667,pune,pune,pune,NaN,262122.1667
11,NaN,NaN,NaN,NaN,262122.166667,pune,pune,NaN,NaN,262122.1667
12,108.0,NaN,NaN,NaN,262122.166667,pune,pune,NaN,NaN,262122.1667
13,109.0,rahul,pune,64646.0,64646.000000,pune,pune,pune,chennai,64646.0000

In [102]:
df['city'].fillna('mumbai')

0       pune
1       pune
2     mumbai
3     mumbai
4     mumbai
5     mumbai
6     mumbai
7       pune
8       pune
9     mumbai
10    mumbai
11    mumbai
12    mumbai
13      pune
Name: city, dtype: object

In [103]:
df

,id,name,city,sal,sal_mean,city_ffill,city_bfill,city_limit,city1,sal_round
0,101.0,keshav,pune,54545.0,54545.000000,pune,pune,pune,chennai,54545.0000
1,102.0,rahul,pune,64646.0,64646.000000,pune,pune,pune,chennai,64646.0000
2,103.0,ram,NaN,NaN,262122.166667,pune,mumbai,pune,NaN,262122.1667
3,NaN,NaN,NaN,NaN,262122.166667,pune,mumbai,pune,NaN,262122.1667
4,NaN,NaN,NaN,NaN,262122.166667,pune,mumbai,NaN,NaN,262122.1667
5,NaN,NaN,NaN,NaN,262122.166667,pune,mumbai,NaN,NaN,262122.1667
6,104.0,sonali,mumbai,565665.0,565665.000000,mumbai,mumbai,mumbai,mumbai,565665.0000
7,105.0,monali,pune,65656.0,65656.000000,pune,pune,pune,chennai,65656.0000
8,106.0,rakesh,pune,757575.0,757575.000000,pune,pune,pune,chennai,757575.0000
9,107.0,NaN,NaN,NaN,262122.166667,pune,pune,pune,NaN,262122.1667
10,NaN,NaN,NaN,NaN,262122.166667,pune,pune,pune,NaN,262122.1667
11,NaN,NaN,NaN,NaN,262122.166667,pune,pune,NaN,NaN,262122.1667
12,108.0,NaN,NaN,NaN,262122.166667,pune,pune,NaN,NaN,262122.1667
13,109.0,rahul,pune,64646.0,64646.000000,pune,pune,pune,chennai,64646.0000

In [105]:
df['sal'].mean()

262122.16666666666

In [107]:
df['sal'].sum()

1572733.0

In [108]:
df['sal'].std()

315370.4708100723

In [109]:
df['sal'].max()

757575.0

In [110]:
df['sal'].min()

54545.0

In [112]:
df['sal'].count()

6

In [115]:
df

    eid               ename                       eemailid               city
0     1        Tamara House            carol99@example.com          Whitestad
1     2    Patricia Stevens          hbradford@example.net      East Veronica
2     3         Victor Ryan           joseph88@example.com     Gutierrezmouth
3     4         David Glass     timothyroberts@example.org   East Kristenstad
4     5      Lori Contreras            msawyer@example.com     North Luisside
..  ...                 ...                            ...                ...
95   96          Jill Tapia              fchen@example.org       South Vernon
96   97        Alexis Smith       timothysmith@example.net        Millerburgh
97   98         Terry Cohen  gabriellemartinez@example.com         Meghanside
98   99  Christopher Berger          heather86@example.org  West Lorrainefurt
99  100        Wendy Turner   clarkchristopher@example.net       West Jeffrey

[100 rows x 4 columns]

In [116]:
import csv
import random
from faker import Faker

# Initialize Faker to generate random data
fake = Faker()

# Define departments and cities
departments = ["HR", "Engineering", "Marketing", "Sales", "Finance", "Operations", "Customer Support"]
cities = ["New York", "Los Angeles", "Chicago", "San Francisco", "Houston", "Miami", "Dallas", "Atlanta", "Seattle", "Boston"]

# Create the CSV file with 100 records
filename = "employees.csv"

fields = ["eid", "ename", "city", "department"]
rows = []

for eid in range(1, 101):
    ename = fake.name()
    city = random.choice(cities)
    department = random.choice(departments)
    rows.append([eid, ename, city, department])

# Write the data to CSV file
with open(filename, mode='w', newline='') as file:
    writer = csv.writer(file)
    writer.writerow(fields)
    writer.writerows(rows)

print(f"CSV file '{filename}' has been created successfully!")

CSV file 'employees.csv' has been created successfully!

In [117]:
df = pd.read_csv("employees.csv")

In [119]:
df['department'].value_counts()

department
Finance             22
Sales               17
Marketing           16
Operations          16
HR                  14
Engineering          8
Customer Support     7
Name: count, dtype: int64

In [121]:
df['city'].value_counts()

city
Los Angeles      15
Miami            14
Dallas           11
Boston           10
Seattle          10
Chicago           9
Houston           9
Atlanta           9
New York          7
San Francisco     6
Name: count, dtype: int64

In [123]:
len(df['department'].unique())

7

In [124]:
df['department'].nunique()

7

In [133]:
df[((df['department']=='Finance') & (df['city']=='Boston'))][['ename','city']]

                 ename    city
0           Lori Davis  Boston
12  Veronica Morris MD  Boston
28     Sarah Henderson  Boston
61      Rebecca Murphy  Boston
87       Garrett White  Boston

In [134]:
df

    eid            ename     city        department
0     1       Lori Davis   Boston           Finance
1     2     Kristi Lynch  Seattle         Marketing
2     3    Phyllis Terry   Boston       Engineering
3     4      Edwin Smith   Dallas           Finance
4     5       Rebekah Le    Miami  Customer Support
..  ...              ...      ...               ...
95   96   Kevin Thompson   Dallas       Engineering
96   97     Julie Martin   Dallas        Operations
97   98      David Scott  Chicago         Marketing
98   99  Angel Dickerson  Seattle           Finance
99  100     Tiffany Rowe  Chicago             Sales

[100 rows x 4 columns]

In [135]:
df

    eid            ename     city        department
0     1       Lori Davis   Boston           Finance
1     2     Kristi Lynch  Seattle         Marketing
2     3    Phyllis Terry   Boston       Engineering
3     4      Edwin Smith   Dallas           Finance
4     5       Rebekah Le    Miami  Customer Support
..  ...              ...      ...               ...
95   96   Kevin Thompson   Dallas       Engineering
96   97     Julie Martin   Dallas        Operations
97   98      David Scott  Chicago         Marketing
98   99  Angel Dickerson  Seattle           Finance
99  100     Tiffany Rowe  Chicago             Sales

[100 rows x 4 columns]

In [ ]:
4. DataFrame Operations

df.apply() – Apply a function along an axis (rows or columns).
df.applymap() – Apply a function element-wise for DataFrames.
df.transform() – Apply a function to each group or column independently.
df.map() – Map values to a Series with a function or dictionary.
df.pivot() – Reshape data by specifying columns as index/values.
df.pivot_table() – Pivot the data with aggregation functions.
df.melt() – Unpivot or reshape data.
df.stack() – Stack the DataFrame into a series.
df.unstack() – Unstack (inverse of stack).
df.sort_values() – Sort by one or more columns.
df.sort_index() – Sort by index.
df.reset_index() – Reset the index.
df.set_index() – Set a column as index.

In [ ]:
df.add() – Add two DataFrames element-wise.
df.subtract() – Subtract two DataFrames element-wise.
df.multiply() – Multiply two DataFrames element-wise.
df.divide() – Divide two DataFrames element-wise.
df.mod() – Modulo (remainder) of two DataFrames element-wise.
df.abs() – Get the absolute value of the DataFrame.
df.round() – Round each element to a given number of decimals.

In [136]:
df = pd.DataFrame({"id":[1,2,3,4],
                   "sal":[30000,50000,25000,58000],
                   
                  })

In [137]:
df1 = pd.DataFrame({"id":[1,2,3,4],
                   "sal":[30000,50000,25000,58000],
                   
                  })

In [138]:
df

   id    sal
0   1  30000
1   2  50000
2   3  25000
3   4  58000

In [139]:
df1

   id    sal
0   1  30000
1   2  50000
2   3  25000
3   4  58000

In [140]:
df.add(df1)

   id     sal
0   2   60000
1   4  100000
2   6   50000
3   8  116000

In [141]:
df.sub(df1)

   id  sal
0   0    0
1   0    0
2   0    0
3   0    0

In [142]:
df.mul(df1)

   id         sal
0   1   900000000
1   4  2500000000
2   9   625000000
3  16  3364000000

In [143]:
df.div(df1)

    id  sal
0  1.0  1.0
1  1.0  1.0
2  1.0  1.0
3  1.0  1.0

In [144]:
df.mod(df1)

   id  sal
0   0    0
1   0    0
2   0    0
3   0    0

In [146]:
df.abs()

   id    sal
0   1  30000
1   2  50000
2   3  25000
3   4  58000

In [149]:
df.sort_values("sal",ascending=False)

   id    sal
3   4  58000
1   2  50000
0   1  30000
2   3  25000

In [150]:
df = pd.read_csv("emprecords.csv")

In [154]:
df.rename({"id":"emp_id","name":"emp_name","sal":"emp_sal"},axis=1,inplace=True)

In [155]:
df

   emp_id emp_name   emp_sal
0     101   keshav     54353
1     102   madhav    434342
2     103   rakesh  23432432
3     104     amit    432432

In [156]:
df.columns = ['a','b','c']

In [160]:
df.sort_values("c",inplace=True)

In [163]:
df.sort_values("c",ascending=False,inplace=True)

In [164]:
df

     a       b         c
2  103  rakesh  23432432
1  102  madhav    434342
3  104    amit    432432
0  101  keshav     54353